#include "SerialDriver.h"
/************************************************************

 ************************************************************/
void  InitSerial()
{

	SCON  = 0x50;//工作方式1，允许串行接收
	
	TMOD |= 0x20;//计时器一 方式二 自动重载初始值
 
	TH1   = 0xFD; //19200
 
	ET1 = 0;//禁止计数器引起中断
	TR1   = 1; //定时器1 开始工作

	ES    = 1;	 //开串口中断
	PS	  = 1 ;	 //串口中断高优先级
}                            
/************************************************************

 ************************************************************/
void SendByte(unsigned char dat)
{
	SBUF = dat;
	while(!TI);
	TI = 0;
}
/************************************************************

 ************************************************************/
void SendStr(unsigned char *s)
{
	SendByte('@');
	while(*s!='\0')
	{
		SendByte(*s);
		s++;
	}
	SendByte('\r');
}
